In [1]:
import pandas as pd

In [6]:
data = {'NOMBRE': ['Maria', 'Jose', 'David', 'Ivan'], 
        'CARRERA': ['Auditoria', 'Informatica','Derecho', 'Idiomas'],
       'CORREO': ['maria@gmail.com', 'jose@gmail.com', 'david@gmail.com', 'ivan@gmail.com']}

In [7]:
estudiantes = pd.DataFrame(data)

In [10]:
estudiantes

  NOMBRE      CARRERA           CORREO
0  Maria    Auditoria  maria@gmail.com
1   Jose  Informatica   jose@gmail.com
2  David      Derecho  david@gmail.com
3   Ivan      Idiomas   ivan@gmail.com

In [6]:
df = pd.DataFrame([['Maria', 27], ['David', 34], ['Jose', 17], ['Ana', 18]], columns=['NOMBRE', 'EDAD'])

In [7]:
df

  NOMBRE  EDAD
0  Maria    27
1  David    34
2   Jose    17
3    Ana    18

In [8]:
import numpy as np

In [23]:
matriz = [[1,2,3], [4,5,6], [7,8,9]]

In [24]:
df2 = pd.DataFrame(matriz, columns=['a', 'b', 'c'])

In [25]:
df2

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [31]:
df3 = pd.DataFrame(np.random.rand(5,3), columns=['PRIMERA', 'SEGUNDA', 'TERCERA'])

In [32]:
df3

    PRIMERA   SEGUNDA   TERCERA
0  0.541158  0.060675  0.118811
1  0.003689  0.719490  0.172638
2  0.766891  0.597287  0.565318
3  0.400833  0.403244  0.414811
4  0.848586  0.237972  0.923961